ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G030/N32G030.svd
            </registers>
        </peripheral>

		<peripheral>
            <name>GPIOA</name>
            <description>General purpose I/O</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x40010800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>GPIOx_PMODE</name>
                    <displayName>GPIOx_PMODE</displayName>
                    <description>GPIOx_PMODE</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xebffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PMODE0</name>
                            <description>PMODE0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE1</name>
                            <description>PMODE1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE2</name>
                            <description>PMODE2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE3</name>
                            <description>PMODE3</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE4</name>
                            <description>PMODE4</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE5</name>
                            <description>PMODE5</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE6</name>
                            <description>PMODE6</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE7</name>
                            <description>PMODE7</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE8</name>
                            <description>PMODE8</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE9</name>
                            <description>PMODE9</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE10</name>
                            <description>PMODE10</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE11</name>
                            <description>PMODE11</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE12</name>
                            <description>PMODE12</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE13</name>
                            <description>PMODE13</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE14</name>
                            <description>PMODE14</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PMODE15</name>
                            <description>PMODE15</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIOx_POTYPE</name>
                    <displayName>GPIOx_POTYPE</displayName>
                    <description>GPIOx_POTYPE</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>POT0</name>
                            <description>POT0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT1</name>
                            <description>POT1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT2</name>
                            <description>POT2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT3</name>
                            <description>POT3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT4</name>
                            <description>POT4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT5</name>
                            <description>POT5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT6</name>
                            <description>POT6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT7</name>
                            <description>POT7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT8</name>
                            <description>POT8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT9</name>
                            <description>POT9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT10</name>
                            <description>POT10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT11</name>
                            <description>POT11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT12</name>
                            <description>POT12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT13</name>
                            <description>POT13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT14</name>
                            <description>POT14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POT15</name>
                            <description>POT15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIOx_SR</name>
                    <displayName>GPIOx_SR</displayName>
                    <description>GPIOx_SR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>SR0</name>
                            <description>SR0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR1</name>
                            <description>SR1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR2</name>
                            <description>SR2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR3</name>
                            <description>SR3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR4</name>
                            <description>SR4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR5</name>
                            <description>SR5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR6</name>
                            <description>SR6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR7</name>
                            <description>SR7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR8</name>
                            <description>SR8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR9</name>
                            <description>SR9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR10</name>
                            <description>SR10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR11</name>
                            <description>SR11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR12</name>
                            <description>SR12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR13</name>
                            <description>SR13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR14</name>
                            <description>SR14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SR15</name>
                            <description>SR15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIOx_PUPD</name>
                    <displayName>GPIOx_PUPD</displayName>
                    <description>GPIOx_PUPD</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x24000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PUPD0</name>
                            <description>PUPD0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD1</name>
                            <description>PUPD1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD2</name>
                            <description>PUPD2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD3</name>
                            <description>PUPD3</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD4</name>
                            <description>PUPD4</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD5</name>
                            <description>PUPD5</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD6</name>
                            <description>PUPD6</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD7</name>
                            <description>PUPD7</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD8</name>
                            <description>PUPD8</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD9</name>
                            <description>PUPD9</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD10</name>
                            <description>PUPD10</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD11</name>
                            <description>PUPD11</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD12</name>
                            <description>PUPD12</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD13</name>
                            <description>PUPD13</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD14</name>
                            <description>PUPD14</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD15</name>
                            <description>PUPD15</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
