ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G030/N32G030.svd
            </registers>			
        </peripheral>

        <peripheral>
            <name>HDIV</name>
            <description>High-speed divider</description>
            <groupName>HDIV</groupName>
            <baseAddress>0x40028000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HDIV_SQRT</name>
                <description>HDIV/SQRT interrupt</description>
                <value>26</value>
            </interrupt>
            <registers>
                <register>
                    <name>HDIV_CTRLSTS</name>
                    <displayName>HDIV_CTRLSTS</displayName>
                    <description>HDIV_CTRLSTS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>HDIVEN</name>
                            <description>HDIVEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDIVSTART</name>
                            <description>HDIVSTART</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDIVBUSY</name>
                            <description>HDIVBUSY</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDIVDF</name>
                            <description>HDIVDF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDIVIF</name>
                            <description>HDIVIF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDIVIEN</name>
                            <description>HDIVIEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDIV_DIVIDEND</name>
                    <displayName>HDIV_DIVIDEND</displayName>
                    <description>HDIV_DIVIDEND</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DIVIDEND</name>
                            <description>DIVIDEND</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDIV_DIVISOR</name>
                    <displayName>HDIV_DIVISOR</displayName>
                    <description>HDIV_DIVISOR</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DIVISOR</name>
                            <description>DIVISOR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDIV_QUOTIENT</name>
                    <displayName>HDIV_QUOTIENT</displayName>
                    <description>HDIV_QUOTIENT</description>
                    <addressOffset>0x0c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>QUOTIENT</name>
                            <description>QUOTIENT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDIV_REMAINDER</name>
                    <displayName>HDIV_REMAINDER</displayName>
                    <description>HDIV_REMAINDER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>REMAINDER</name>
                            <description>REMAINDER</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDIV_DIVBY0</name>
                    <displayName>HDIV_DIVBY0</displayName>
                    <description>HDIV_DIVBY0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>DIVBY0</name>
                            <description>DIVBY0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
