ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G030/N32G030.svd
            </registers>
	    </peripheral>

		<peripheral>
            <name>LPUART</name>
            <description>Low-power universal asynchronous receiver transmitter</description>
            <groupName>LPUART</groupName>
            <baseAddress>0x40004800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPUART</name>
                <description>LPUART global interrupt</description>
                <value>29</value>
            </interrupt>
            <registers>
                <register>
                    <name>LPUART_STS</name>
                    <displayName>LPUART_STS</displayName>
                    <description>LPUART_STS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000001ff</resetMask>
                    <fields>
                        <field>
                            <name>PEF</name>
                            <description>PEF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXC</name>
                            <description>TXC</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_OV</name>
                            <description>FIFO_OV</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_FU</name>
                            <description>FIFO_FU</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_HF</name>
                            <description>FIFO_HF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_NE</name>
                            <description>FIFO_NE</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTS</name>
                            <description>CTS</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUF</name>
                            <description>WUF</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NF</name>
                            <description>NF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                        
                    </fields>
                </register>
				<register>
                    <name>LPUART_INTEN</name>
                    <displayName>LPUART_INTEN</displayName>
                    <description>LPUART_INTEN</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007f</resetMask>
                    <fields>
                        <field>
                            <name>PEIE</name>
                            <description>PEIE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIE</name>
                            <description>TXCIE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_OVIE</name>
                            <description>FIFO_OVIE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_FUIE</name>
                            <description>FIFO_FUIE</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_HFIE</name>
                            <description>FIFO_HFIE</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFO_NEIE</name>
                            <description>FIFO_NEIE</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                        
                        <field>
                            <name>WUFIE</name>
                            <description>WUFIE</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                                               
                    </fields>
                </register>
				<register>
                    <name>LPUART_CTRL</name>
                    <displayName>LPUART_CTRL</displayName>
                    <description>LPUART_CTRL</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007fff</resetMask>
                    <fields>
                        <field>
                            <name>PSEL</name>
                            <description>PSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEN</name>
                            <description>TXEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLUSH</name>
                            <description>FLUSH</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCDIS</name>
                            <description>PCDIS</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOOKBACK</name>
                            <description>LOOKBACK</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_TXEN</name>
                            <description>DMA_TXEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                        
                        <field>
                            <name>DMA_RXEN</name>
                            <description>DMA_RXEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field> 
						<field>
                            <name>WUSTP</name>
                            <description>WUSTP</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTS_THSEL</name>
                            <description>RTS_THSEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CTSEN</name>
                            <description>CTSEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTSEN</name>
                            <description>RTSEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>   
						<field>
                            <name>WESEL</name>
                            <description>WESEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SMPCNT</name>
                            <description>SMPCNT</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>   												
                    </fields>
                </register>
				<register>
                    <name>LPUART_BRCFG1</name>
                    <displayName>LPUART_BRCFG1</displayName>
                    <description>LPUART_BRCFG1</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000174</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>INTEGER</name>
                            <description>INTEGER</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPUART_DAT</name>
                    <displayName>LPUART_DAT</displayName>
                    <description>LPUART_DAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>DAT</name>
                            <description>DAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>                
                <register>
                    <name>LPUART_BRCFG2</name>
                    <displayName>LPUART_BRCFG2</displayName>
                    <description>LPUART_BRCFG2</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>DECIMAL</name>
                            <description>DECIMAL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPUART_WUDAT</name>
                    <displayName>LPUART_WUDAT</displayName>
                    <description>LPUART_WUDAT</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>WUDAT</name>
                            <description>WUDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register> 
