ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G030/N32G030.svd
                <register>
                    <name>RCC_EMCCTRL</name>
                    <displayName>RCC_EMCCTRL</displayName>
                    <description>RCC_EMCCTRL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffffff</resetMask>
                    <fields>
                        <field>
                            <name>CLPDET0EN</name>
                            <description>CLPDET0EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLPDET1EN</name>
                            <description>CLPDET1EN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLPDET2EN</name>
                            <description>CLPDET2EN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLPDET3EN</name>
                            <description>CLPDET3EN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>GBNDET0EN</name>
                            <description>GBNDET0EN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBNDET1EN</name>
                            <description>GBNDET1EN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBNDET2EN</name>
                            <description>GBNDET2EN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBNDET3EN</name>
                            <description>GBNDET3EN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET0EN</name>
                            <description>GBDET0EN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET1EN</name>
                            <description>GBDET1EN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET2EN</name>
                            <description>GBDET2EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET3EN</name>
                            <description>GBDET3EN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLP0RST</name>
                            <description>CLP0RST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>CLP1RST</name>
                            <description>CLP1RST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>CLP2RST</name>
                            <description>CLP2RST</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>CLP3RST</name>
                            <description>CLP3RST</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>GBN0RST</name>
                            <description>GBN0RST</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBN1RST</name>
                            <description>GBN1RST</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBN2RST</name>
                            <description>GBN2RST</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBN3RST</name>
                            <description>GBN3RST</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB0RST</name>
                            <description>GB0RST</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB1RST</name>
                            <description>GB1RST</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB2RST</name>
                            <description>GB2RST</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB3RST</name>
                            <description>GB3RST</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
