ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G030/N32G030.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART2</name>
            <baseAddress>0x40004400</baseAddress>   
            <interrupt>
                <name>USART2</name>
                <description>USART2 global interrupt</description>
                <value>17</value>
            </interrupt>         
        </peripheral>

        <peripheral>
            <name>WWDG</name>
            <description>window watchdog</description>
            <groupName>WWDG</groupName>
            <baseAddress>0x40002C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDG</name>
                <description>WWDG interrupt</description>
                <value>0</value>
            </interrupt>			
            <registers>
                <register>
                    <name>WWDG_CTRL</name>
                    <displayName>WWDG_CTRL</displayName>
                    <description>WWDG_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007f</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>T</name>
                            <description>T</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ACTB</name>
                            <description>ACTB</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>WWDG_CFG</name>
                    <displayName>WWDG_CFG</displayName>
                    <description>WWDG_CFG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007f</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>W</name>
                            <description>W</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>TIMERB</name>
                            <description>TIMERB</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EWINT</name>
                            <description>EWINT</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>WWDG_STS</name>
                    <displayName>WWDG_STS</displayName>
                    <description>WWDG_STS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>EWINTF</name>
                            <description>EWINTF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>	
        </peripheral>

    </peripherals>
</device>
